# TextureURepeat Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BumpMap..::..TextureURepeat Property
BumpMap Class See Also
---
The property labeled "U Repeat" from the "BumpMap" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string TextureURepeat { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextureURepeat As String
	Get
```

Visual C++
---
```text
public:
static property String^ TextureURepeat {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
BumpMap Class
Autodesk.Revit.DB.Visual Namespace